
{
  "1:1": {
    "t": "In the name of Allāh, the Entirely Merciful, the Especially Merciful."
  },
  "1:2": {
    "t": "[All] praise is [due] to Allāh, Lord of the worlds -"
  },
  "1:3": {
    "t": "The Entirely Merciful, the Especially Merciful,"
  },
  "1:4": {
    "t": "Sovereign of the Day of Recompense."
  },
  "1:5": {
    "t": "It is You we worship and You we ask for help."
  },
  "1:6": {
    "t": "Guide us to the straight path -"
  },
  "1:7": {
    "t": "The path of those upon whom You have bestowed favor, not of those who have earned [Your] anger or of those who are astray."
  },
  "10:1": {
    "t": "Alif, Lām, Rā. These are the verses of the wise Book."
  },
  "10:2": {
    "t": "Have the people been amazed that We revealed [revelation] to a man from among them, [saying], \"Warn mankind and give good tidings to those who believe that they will have a [firm] precedence of honor with their Lord\"? [But] the disbelievers say, \"Indeed, this is an obvious magician.\""
  },
  "10:3": {
    "t": "Indeed, your Lord is Allāh, who created the heavens and the earth in six days and then established Himself above the Throne, arranging the matter [of His creation]. There is no intercessor except after His permission. That is Allāh, your Lord, so worship Him. Then will you not remember?"
  },
  "10:4": {
    "t": "To Him is your return all together. [It is] the promise of Allāh [which is] truth. Indeed, He begins the [process of] creation and then repeats it that He may reward those who have believed and done righteous deeds, in justice. But those who disbelieved will have a drink of scalding water and a painful punishment for what they used to deny."
  },
  "10:5": {
    "t": "It is He who made the sun a shining light and the moon a derived light and determined for it phases - that you may know the number of years and account [of time]. Allāh has not created this except in truth. He details the signs for a people who know."
  },
  "10:6": {
    "t": "Indeed, in the alternation of the night and the day and [in] what Allāh has created in the heavens and the earth are signs for a people who fear Allāh."
  },
  "10:7": {
    "t": "Indeed, those who do not expect the meeting with Us and are satisfied with the life of this world and feel secure therein and those who are heedless of Our signs -"
  },
  "10:8": {
    "t": "For those their refuge will be the Fire because of what they used to earn."
  },
  "10:9": {
    "t": "Indeed, those who have believed and done righteous deeds - their Lord will guide them because of their faith. Beneath them rivers will flow in the Gardens of Pleasure."
  },
  "10:10": {
    "t": "Their call therein will be, \"Exalted are You, O Allāh,\" and their greeting therein will be, \"Peace.\" And the last of their call will be, \"Praise to Allāh, Lord of the worlds!\""
  },
  "10:11": {
    "t": "And if Allāh was to hasten for the people the evil [they invoke] as He hastens for them the good, their term would have been ended for them. But We leave the ones who do not expect the meeting with Us, in their transgression, wandering blindly."
  },
  "10:12": {
    "t": "And when affliction touches man, he calls upon Us, whether lying on his side or sitting or standing; but when We remove from him his affliction, he continues [in disobedience] as if he had never called upon Us to [remove] an affliction that touched him. Thus is made pleasing to the transgressors that which they have been doing."
  },
  "10:13": {
    "t": "And We had already destroyed generations before you when they wronged, and their messengers had come to them with clear proofs, but they were not to believe. Thus do We recompense the criminal people."
  }
}
