
{
  "1:1": {
    "text": "<p>Bismillah بِسْمِ اللَّـهِ is a verse of the Holy Qur'an</p><p>There is consensus of all the Muslims on the fact that Bismillah al-Rahman al-Rahim بِسْمِ اللَّـهِ الرَّ‌حْمَـٰنِ الرَّ‌حِيمِ is a verse of the Holy Qur'an, being a part of the Surah al-Naml سورة النمل (The Ant); and there is also an agreement on that this verse is written at the head of every Surah except the Surah al-Taubah سورة التوبہ . But there is a difference of opinion among the Mujtahids مجتہدین (the authentic scholars who are entitled to express an opinion in such matters) as to whether this verse is an integral part of the Surah al-Fatihah or of all the Surahs or not. According to the great Imam Abu Hanifah (رح) ، it is not an integral part of any Surah except al-Naml, rather it is in itself an independent verse of the Holy Qur'an which has been revealed for being placed at the beginning of every Surah in order to separate and distinguish one Surah from another.</p><p>The merits of Bismillah بسمِ اللہ</p><p>It was a custom in the Age of Ignorance (Jahiliyyah جاہلیہ ) before the advent of Islam that people began everything they did with the names of their idols or gods. It was to eradicate this practice that the first verse of the Holy Qur'an which the Archangel Jibra'il (علیہ السلام) brought down to the Holy Prophet ﷺ commanded him to begin the Qur'an with the name of Allah اقْرَأْ بِاسْمِ رَبِّكَ \"Read with the name of your Lord.\"</p><p>The famous commentator al-Suyuti says that beside the Holy Qur'an all the other divine books too begin with Bismillah. Certain other scholars are of the opinion that Bismillah al-Rahman al-Rahim بِسْمِ اللَّـهِ الرَّ‌حْمَـٰنِ الرَّ‌حِيمِ is peculiar to the Qur'an and to the followers of Muhammad ﷺ . The two views can be brought into agreement with each other if we 'say that all the divine books share the common trait of beginning with the name of Allah, but the words Bismillah Al-Rahman Al-Rahim بِسْمِ اللَّـهِ الرَّ‌حْمَـٰنِ الرَّ‌حِيمِ are peculiar to the Holy Qur'an, as is evident from certain Traditions (Ahadith) which report that in order to begin with the name of Allah anything he, undertook, the Holy Prophet ﷺ used to say the words بِسْمِک اللَّـهِم (Bismika Allahumma), but when the verse Bismillah Al-Rahman Al-Rahim بِسْمِ اللَّـهِ الرَّ‌حْمَـٰنِ الرَّ‌حِيمِ was revealed, he adopted these words. Since then this practice was established through the verbal command of the Holy Prophet ﷺ or through his act or tacit approval). (See Qurtubi and Ruh al-Ma` ani)</p><p>The Holy Qur'an again and again instructs us to begin what we do with the name of Allah. The Holy Prophet ﷺ has said that</p><p>no important work receives the blessings of Allah, unless it is begun</p><p>with His name. According to yet another hadith (Tradition), closing the door of one's house, putting out the lamp, covering a vessel, should all be done with the recitation of Bismillah. The Holy Qur'an and the ahadith (Traditions"
  }
}
