
{
  "1:1": {
    "text": "<div lang=\"en\" class=\"en \"><h2>The Meaning of Al Fatiha &amp; its Various Names</h2></div><p lang=\"en\" class=\"en \">This Surah is called Al-Fatihah, that is, the Opener of the Book, the Surah with which prayers are begun. It is also called, Umm Al-Kitab <span class=\"gray\">(the Mother of the Book)</span>, according to the majority of the scholars. In an authentic Hadith recorded by At-Tirmidhi, who graded it Sahih, Abu Hurayrah said that the Messenger of Allah ﷺ said,</p><p class=\"ar qpc-hafs\" lang=\"ar\">الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ أُمُّ الْقُرْآنِ وَأُمُّ الْكِتَابِ وَالسَّبْعُ الْمَثَانِي وَالْقُرْآنُ الْعَظِيمُ</p><p lang=\"en\" class=\"en \"><span class=\"gray\">(Al-Hamdu lillahi Rabbil-'Alamin is the Mother of the Qur'an, the Mother of the Book, and the seven repeated Ayat of the Glorious Qur'an.)</span></p><p lang=\"en\" class=\"en \">It is also called Al-Hamd and As-Salah, because the Prophet ﷺ said that his Lord said,</p><p class=\"ar qpc-hafs\" lang=\"ar\">قَسَمْتُ الصَّلَاةَ بَيْنِي وَبَيْنَ عَبْدِي نِصْفَيْنِ، فَإِذَا قَالَ الْعَبْدُ: الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ، قَالَ اللهُ: حَمِدَنِي عَبْدِي</p><p lang=\"en\" class=\"en \"><span class=\"gray\">('The prayer <span class=\"gray\">(i.e., Al-Fatihah)</span> is divided into two halves between Me and My servants.' When the servant says, 'All praise is due to Allah, the Lord of existence,' Allah says, 'My servant has praised Me.')</span></p>"
  },
  "1:2": {
    "text": "<p lang=\"en\" class=\"en \">This verse begins the praise of Allah, the Lord of all creation. The word 'Alhamdulillah' encompasses all forms of praise and gratitude to Allah for His countless blessings and favors upon His creation.</p>"
  },
  "1:3": {
    "text": "<p lang=\"en\" class=\"en \">Ar-Rahman and Ar-Rahim are two of the most beautiful names of Allah, both derived from the root meaning mercy. Ar-Rahman refers to Allah's general mercy that encompasses all creation, while Ar-Rahim refers to His specific mercy for the believers.</p>"
  },
  "1:4": {
    "text": "<p lang=\"en\" class=\"en \">This verse establishes Allah as the ultimate judge and ruler on the Day of Judgment. It reminds us that all authority and judgment belong to Allah alone, and that we will all return to Him for the final reckoning.</p>"
  },
  "1:5": {
    "text": "<p lang=\"en\" class=\"en \">This verse contains both worship and supplication. 'You alone we worship' is a declaration of monotheism (Tawhid), while 'You alone we ask for help' is a recognition of our complete dependence on Allah for all our needs.</p>"
  },
  "1:6": {
    "text": "<p lang=\"en\" class=\"en \">This is the central supplication of Al-Fatihah, where we ask Allah to guide us to the straight path. The straight path (Sirat al-Mustaqim) is the path of Islam, the path of righteousness and guidance that leads to paradise.</p>"
  },
  "1:7": {
    "text": "<p lang=\"en\" class=\"en \">This verse clarifies the straight path by contrasting it with the paths of those who went astray. 'Those You have blessed' refers to the prophets, truthful ones, martyrs, and righteous people. 'Those who incurred Your wrath' traditionally refers to those who knew the truth but rejected it, while 'those who went astray' refers to those who were misguided in their worship.</p>"
  }
}
